import "./remark.css";
import React, { useEffect } from "react";
import Logo from "../components/logo";
import Remark2 from "./remark2";
import liff from "@line/liff";
export default function Remark() {
  useEffect(() => {
    liff
      .init({ liffId: import.meta.env.VITE_REMARK_ID })
      .then(() => {
        if (liff.isLoggedIn()) {
          console.log("logged in");
        } else {
          liff.login();
        }
      })
      .catch((err) => console.error("Error initializing LIFF:", err));
  }, []);

  return (
    <div className="page">
      <Logo />
      <div className="remark-content">
        <h1>คำแนะนำในการเลือกผู้ให้การปรึกษา</h1>
        <p>
          1. ทางระบบ จะเเสดงรายการผู้ให้การปรึกษาเรียงลำดับ
          คุณสามารถเลือกได้จากรายชื่อ ผู้ให้การปรึกษาทั้งหมด
          <br />
          2. คุณสามารถเลือก ผู้ให้การปรึกษา
          แต่ละท่านได้จากประสบการณ์ในการให้การปรึกษา
          ความถนัดในหัวข้อที่คุณคิดว่าเหมาะสมกับประเด็นที่ต้องการปรึกษา
          <br />
          3.
          ในกรณีที่คุณได้ทำการปรึกษากับผู้ให้การปรึกษาท่านใดแล้วรู้สึกว่าไม่พึงพอใจ
          คุณสามารถเปลี่ยน ผู้ให้การปรึกษา ในครั้งต่อไปได้ทันที
          ผ่านระบบการนัดหมายดังเดิม
          <br />
          4. หากคุณต้องการปรึกษากับ ผู้ให้การปรึกษา
          กรุณาจองเวลานัดหมายล่วงหน้าอย่างน้อย 6 ชม
          เพื่อประสิทธิภาพในการให้การปรึกษา
          <br />
        </p>
        <h1>ข้อแนะนำในการเตรียมตัวเพื่อรับบริการ ดังนี้</h1>
        <p>
          1. เตรียมตัวล่วงหน้า 10 นาทีก่อนการรับบริการ
          ตรวจสอบเครื่องมือสื่อสารของท่าน
          ให้อยู่ในสภาพที่พร้อมรับบริการได้อย่างต่อเนื่อง 45-60 นาที
          <br />
          2. อยู่ในสภาพแวดล้อมที่มีความเป็นส่วนตัว ไม่มีเสียงรบกวน
          ไม่อยู่ในจุดอับสัญญาน
          ซึ่งอาจส่งผลถึงประสิทธิภาพในการให้การปรึกษาของท่าน
          <br />
          <mark>***</mark>3.
          ท่านสามารถติดตามบทสรุปแนวทางการให้การปรึกษาและแนวทางการติดตามผลในครั้งต่อไป
          หลังจากสิ้นสุดการรับบริการครั้งนี้ ภายใน 48 ชม.
          เราขอให้ท่านปฏิบัติตามแนวทางที่ได้ตกลงร่วมกันกับทางผู้ให้การปรึกษาเพื่อให้ท่านสามารถพัฒนาศักยภาพและนำไปสู่ตัวตนที่ดียิ่งขึ้น
          <br />
          4. ผู้ให้การปรึกษาจะให้การปรึกษาในกรณีไม่ฉุกเฉินเท่านั้น ในกรณีฉุกเฉิน
          โทร 1323 ตลอด 24 ชม.
        </p>
      </div>
      <div className="remark-footer">
        <a href="/remark2">
          <button className="btn btn-next">ทำแบบประเมิน</button>
        </a>
      </div>
    </div>
  );
}
